{
  "dogfooding": {
    "title": "Dogfooding (Auto-Consumo)",
    "definition": "A prática de usar a própria ferramenta para desenvolver a ferramenta. O Doxoade é testado rodando 'doxoade check .' em si mesmo. É a forma mais rápida de encontrar falhas de UX e bugs.",
    "origin": "Prática padrão da indústria (Microsoft, anos 80)."
  },
  "ast_analysis": {
    "title": "Análise AST (Abstract Syntax Tree)",
    "definition": "Técnica usada pelo 'check' e 'guicheck'. Em vez de ler o código como texto (Regex), transformamos o código em uma árvore lógica. Permite entender que 'x = 1' é uma atribuição, não apenas caracteres.",
    "origin": "Compiladores."
  },
  "atomic_write": {
    "title": "Escrita Atômica",
    "definition": "Padrão de segurança para salvar arquivos. Nunca sobrescreve o arquivo original diretamente. 1. Escreve num arquivo temporário. 2. Se der sucesso, faz 'os.replace' (que é atômico). Evita corrupção se o PC desligar no meio.",
    "origin": "Sistemas de Arquivos / Bancos de Dados."
  },
  "exit_code_contract": {
    "title": "Contrato do Código de Saída",
    "definition": "A regra de ouro da automação: Se uma ferramenta falha, ela DEVE retornar 'exit(1)'. Se retornar 0, ferramentas de orquestração (como 'auto' ou CI/CD) acharão que deu tudo certo. Foi a causa do bug 'Sucesso Falso'.",
    "origin": "Unix/POSIX."
  },
  "ux_driven_design": {
    "title": "Design Orientado a UX",
    "definition": "Filosofia onde a complexidade técnica é absorvida pela ferramenta para simplificar a vida do usuário. Exemplo: A rejeição do 'create-pipeline' em favor do 'auto' com gestão transparente de arquivos temporários.",
    "origin": "Lição aprendida na Saga do Auto."
  },
  "fail_loudly": {
    "title": "Princípio Falhe Ruidosamente",
    "definition": "Uma ferramenta que falha com um erro explícito é melhor do que uma que falha silenciosamente ou finge sucesso. A transparência constrói confiança.",
    "origin": "Crise da Confiança (Outubro 2025)."
  },
  "probing": {
    "title": "Sondagem (Probing)",
    "definition": "Técnica de injetar um script mínimo em um ambiente externo para extrair dados (como dependências instaladas) sem contaminar o processo principal com imports conflitantes.",
    "origin": "Resolvendo o Paradoxo dos Dois Ambientes."
  },
  "hardening": {
    "title": "Hardening (Endurecimento)",
    "definition": "O processo de proteger um sistema reduzindo sua superfície de vulnerabilidade. No Doxoade, envolveu remover 'shell=True', trocar MD5 por SHA256 e eliminar o uso de Pickle inseguro.",
    "origin": "Segurança da Informação."
  },
  "double_filtering": {
    "title": "Filtragem Dupla (Double Filtering)",
    "definition": "Técnica usada no comando 'security'. Como ferramentas externas (Bandit) às vezes ignoram configurações de exclusão, o Doxoade aplica um segundo filtro em Python no JSON de resultados, garantindo que pastas como 'venv' nunca gerem alertas falsos.",
    "origin": "Correção do Doxoade v55 (Dez 2025)."
  },
  "relative_regression": {
    "title": "Regressão Relativa",
    "definition": "Filosofia de teste onde o sucesso é medido pela não-deterioração do sistema. Permite que o desenvolvimento continue em projetos com dívida técnica (testes falhando), desde que novos bugs não sejam introduzidos.",
    "origin": "Doxoade QA v63.0"
  },
  "test_scaffolding": {
    "title": "Test Scaffolding (Andaime de Testes)",
    "definition": "Geração automática de arquivos de teste vazios ('esqueletos') que espelham a estrutura do código fonte. Garante 100% de cobertura arquitetural, servindo de lembrete e base para a implementação da lógica de teste real.",
    "origin": "Comando 'test-map --generate'"
  },
  "safe_sync": {
    "title": "Safe Sync (Sincronização Segura)",
    "definition": "Modo de operação do Git onde o Doxoade realiza uma auditoria 'Pré-Voo' (Dry Run) comparando as árvores locais e remotas. Se detectar deleções ou sobrescritas perigosas, exige confirmação manual explícita antes de executar o comando real.",
    "origin": "Comando 'sync --safe'"
  },
  "lean_analytics": {
    "title": "Lean Analytics (Análise Enxuta)",
    "definition": "Prática de processamento de dados estatísticos sem dependências de frameworks de Data Science (como Pandas). Utiliza estruturas nativas como 'collections.Counter' e 'rich.table' para garantir que ferramentas de engenharia rodem instantaneamente em dispositivos móveis e Termux.",
    "origin": "Refatoração Doxoade v69 - Mobile-First Initiative."
  },
  "architectural_linting": {
    "title": "Architectural Linting (Linter de Arquitetura)",
    "definition": "Diferente do linter de sintaxe (como Pyflakes), o linter de arquitetura valida regras de design e robustez, como o tamanho das funções, o nível de aninhamento e a presença de contratos, baseando-se no Modern Power of Ten.",
    "origin": "Doxoade Core - Comando 'style'."
  }
}