{
  "probe_pattern": {
    "title": "Padrão da Sonda Isolada (The Probe)",
    "context": "Resolvendo o 'Paradoxo dos Dois Ambientes' (OADE-GLO-V3).",
    "content": "Problema: Analisar um venv externo a partir do venv do Doxoade gera conflitos de importação.\nSolução: Não importe nada. Injete um script 'burro' (sem dependências) no python do alvo via subprocesso, capture o JSON de saída e analise-o no processo pai.\nUso: 'optimize', 'check', 'doctor'."
  },
  "transparent_abstraction": {
    "title": "Abstração Transparente (Bypass de Shell)",
    "context": "Resolvendo a 'Saga das Aspas' no Windows (OADE-26).",
    "content": "Problema: O cmd.exe quebra argumentos com aspas aninhadas, tornando impossível passar comandos complexos via CLI.\nSolução: O comando recebe os args, escreve-os num arquivo temporário seguro (tempfile), e executa o arquivo. O usuário não vê o arquivo, mas a execução é perfeita.\nUso: 'doxoade auto'."
  },
  "self_sufficient_bootstrap": {
    "title": "Bootstrap Autossuficiente",
    "context": "Resolvendo a 'Crise da Portabilidade' (OADE-251020).",
    "content": "Problema: 'ImportError: attempted relative import' quando instalado via pip.\nSolução: Um bloco de código no topo do entry-point que calcula sua própria localização e injeta o caminho pai no sys.path antes de qualquer import.\nResultado: O Doxoade roda igual se for script, módulo ou executável."
  },
  "manager_specialist": {
    "title": "Padrão Gerente-Especialista",
    "context": "Expansão do 'guicheck' para Kivy e Tkinter (OADE-29).",
    "content": "Problema: Como analisar múltiplos frameworks sem criar um 'god-object'?\nSolução: Separar a lógica em um 'Gerente' (detecta o tipo de arquivo) e 'Especialistas' (sabem analisar apenas uma tecnologia). Adicionar suporte a PyQt agora exige apenas criar um novo especialista."
  },
  "secure_contract_pattern": {
    "title": "Padrão de Contrato Blindado (Secure Contract)",
    "context": "Resolvendo o conflito entre MPoT-5 (Asserções) e Segurança (Bandit LOW: B101).",
    "content": "Problema: Asserts são removidos em Python otimizado (-O), deixando o sistema vulnerável a falhas silenciosas.\nSolução: Substituir 'assert condition' por verificações explícitas 'if not condition: raise ValueError()'. Isso garante a validade do contrato em qualquer modo de execução.\nUso: 'doxoade dashboard', 'doxoade health'.",
    "linked_policy": "policy_r0"
  },
  "ast_web_extraction": {
    "title": "Extração de Web-in-Python via AST",
    "context": "Validando sintaxe web dentro de frameworks declarativos (NiceGUI/Streamlit).",
    "content": "O sistema percorre a árvore sintática (AST) do Python em busca de chamadas específicas (ex: 'ui.html', '.style'). O conteúdo das strings constantes é isolado e passado para analisadores especializados de HTML/CSS como se fossem arquivos independentes.",
    "linked_incident": "webcheck_v2_nicegui"
  },
  "payload_probing": {
    "title": "Payload Probing (Sondagem por Carga Útil)",
    "context": "Comunicação entre o Core do Doxoade e sub-processos de análise.",
    "content": "Em vez de passar múltiplos argumentos via CLI (que podem estourar o limite de caracteres no Windows), o Core envia um objeto JSON (Payload) via stdin para a sonda. A sonda processa e devolve o resultado via stdout, também em JSON.",
    "linked_incident": "saga_quotes"
  },
  "total_type_consistency": {
    "title": "Consistência Total de Tipos (MPoT-7)",
    "context": "Evitando falhas silenciosas de 'NoneType' em pipelines de dados.",
    "content": "Funções de utilidade (como leitores de arquivos) devem retornar um objeto vazio do mesmo tipo esperado (ex: '' para string, [] para lista) em vez de 'None' em caso de erro não-fatal. Isso simplifica a lógica do chamador e previne quebras de runtime descobertas pelo deepcheck.",
    "linked_incident": "deepcheck_mixed_returns"
  },
  "safe_evolution_loop": {
    "title": "Loop de Evolução Segura (Safe-Save)",
    "context": "Fluxo principal de salvamento do projeto.",
    "content": "O comando 'save' atua como um portão de qualidade. Ele impede a entrada de erros 'CRITICAL' ou 'ERROR' no histórico do Git. Após o commit, ele analisa a diferença entre os incidentes abertos e o código atual para alimentar o motor Gênese com soluções bem-sucedidas.",
    "linked_policy": "policy_r0"
  },
  "contract_synchronization": {
    "title": "Sincronização de Contratos em Testes",
    "context": "Ajustando suítes de teste após refatorações MPoT-7.",
    "content": "Ao aplicar a consistência de tipos (evitar retornos None), os testes unitários devem ser atualizados para validar o 'Objeto Vazio' (Null Object Pattern) correspondente. Isso garante que os pipelines de dados subsequentes não precisem de checagens 'if x is not None', reduzindo a complexidade ciclomática global.",
    "linked_incident": "pytest_save_contract_mismatch"
  },
  "hybrid_probe_parsing": {
    "title": "Parsing de Sondas Híbridas",
    "context": "Gerenciando diferentes formatos de saída de sub-processos.",
    "content": "Implementado o padrão 'Format-Aware Dispatch'. O orquestrador detecta o tipo de sonda (Texto vs JSON) e aplica o parser correspondente. Sondas legadas (Pyflakes) são processadas via Regex, enquanto sondas modernas (Hunter/Style) são decodificadas como objetos JSON estruturados.",
    "linked_incident": "regression_check_v38.2"
  },
  "lazy_group_dispatcher": {
    "title": "Padrão Despachante Lazy (Lazy Group)",
    "context": "Startup do CLI com 50+ comandos.",
    "content": "Substitui o registro imediato de comandos por um mapeamento de strings. O módulo só é carregado via importlib no momento do 'get_command'."
  },
  "background_persistence_worker": {
    "title": "Trabalhador de Persistência (Async Buffer)",
    "context": "Latência de escrita em banco de dados SQLite.",
    "content": "Isola operações de I/O em uma thread separada usando uma fila thread-safe. Remove o bloqueio da thread principal de execução."
  },
  "semantic_diff_audit": {
    "title": "Auditoria de Diff Semântico",
    "context": "Revisão pré-commit em repositórios massivos.",
    "content": "Parser de diff otimizado que extrai assinaturas de funções e comentários, ignorando metadados de baixo nível do Git para foco em engenharia."
  },
  "historical_signature_comparison": {
    "title": "Comparação de Assinatura Histórica",
    "context": "Detecção de regressões em refatorações de longa duração.",
    "content": "Padrão que utiliza o Git como banco de dados de conteúdo e a AST como parser de estrutura para validar a evolução da interface de um arquivo."
  },
  "expert_split_render": {
    "title": "Renderização Expert-Split",
    "context": "Redução de complexidade em comandos de interface.",
    "content": "Decomposição de funções de UI em sub-renderizadores especialistas (Env, Git, Integrity, Changes). Mantém a Complexidade Ciclomática (CC) abaixo de 6 mesmo em relatórios densos."
  },
  "lazy_group_routing": {
    "title": "Roteamento de Grupo Lazy",
    "context": "Startup de CLI com múltiplas dependências.",
    "content": "Uso de mapeamento estático 'string:modulo' para adiar imports até o momento da invocação. Vital para performance em hardware ARM/RISC."
  }
}