{
  "shadowing_crisis": {
    "title": "A Crise do Sombreamento (Name Shadowing)",
    "date": "2025-11-22",
    "severity": "CRITICAL",
    "symptom": "ModuleNotFoundError no Linux/Termux apesar de instalação correta.",
    "root_cause": "O arquivo de entrada chamava-se 'doxoade.py' e a pasta do pacote também 'doxoade/'. O interpretador priorizava o arquivo, ocultando o pacote.",
    "fix": "Renomeação definitiva do entry-point para 'cli.py'."
  },
  "silent_failure": {
    "title": "A Falha Silenciosa (A Ilusão de Sucesso)",
    "date": "2025-10-25",
    "severity": "CATASTROPHIC",
    "symptom": "Comandos 'check' e 'optimize' reportavam [OK] em projetos vazios ou quebrados.",
    "root_cause": "Lógica de descoberta de arquivos falhava silenciosamente se o diretório não existisse ou se a configuração estivesse errada.",
    "fix": "Implementação da 'Fonte Única da Verdade' (_get_project_config) que falha ruidosamente (exit 1) se a configuração for inválida."
  },
  "unicode_plague": {
    "title": "A Praga do Unicode (Windows CP1252)",
    "date": "2025-11-23",
    "severity": "HIGH",
    "symptom": "Crash imediato ao tentar imprimir emojis ou barras verticais no cmd.exe.",
    "root_cause": "Assumir que todo terminal é UTF-8. O Windows padrão usa CP1252.",
    "fix": "Implementação de Fallback Seguro: tentar imprimir UTF-8, se falhar (UnicodeEncodeError), usar caracteres ASCII simples."
  },
  "zombie_process": {
    "title": "O Processo Zumbi (GUI Deadlock)",
    "date": "2025-09-14",
    "severity": "MEDIUM",
    "symptom": "CTRL+C não encerrava o 'doxoade run' se a GUI filha travasse.",
    "root_cause": "Subprocesso bloqueante sem tratamento de sinais.",
    "fix": "Migração para subprocess.Popen não-bloqueante e envio explícito de kill() ao capturar KeyboardInterrupt."
  },
  "toxic_memory_spill": {
    "title": "O Vazamento de Memória Tóxica",
    "date": "2025-12-22",
    "severity": "HIGH",
    "symptom": "O Agente recomendava código quebrado ('def <UNK>') com alta confiança.",
    "root_cause": "Falta de validação no pipeline de memorização. O sistema priorizava similaridade semântica sobre validade sintática.",
    "fix": "Implementação de Quality Gates no Librarian e comando 'brain forget' para purga."
  },
  "dimensional_collapse": {
    "title": "O Colapso Dimensional (Batching)",
    "date": "2025-12-21",
    "severity": "CRITICAL",
    "symptom": "Crash durante treino acelerado: 'ValueError: broadcast shape mismatch'.",
    "root_cause": "A camada de Embedding não sabia lidar com tensores 3D introduzidos pelo True Batching.",
    "fix": "Core v18.0 com Universal Shape Adaptor (reshape dinâmico de gradientes)."
  },
  "pandas_weight_crisis": {
    "title": "A Crise de Peso do Dashboard (Pandas Overhead)",
    "date": "2025-12-30",
    "severity": "MEDIUM",
    "symptom": "Lentidão extrema na inicialização do comando 'dashboard' no Termux e consumo de 52MB extras de RAM.",
    "root_cause": "Uso de 'pandas' para operações simples de contagem e agrupamento que poderiam ser feitas nativamente.",
    "fix": "Remoção total da dependência Pandas. Implementação de lógica de agregação via SQL e agrupamento via 'collections.Counter'. Ganho de 90% na velocidade de startup."
  },
  "pytest_import_error": {
    "title": "Falha de Descoberta de Módulo no Pytest",
    "date": "2025-12-30",
    "severity": "LOW",
    "symptom": "ModuleNotFoundError ao rodar testes unitários, apesar do pacote estar instalado.",
    "root_cause": "O Pytest não injeta automaticamente o diretório raiz no sys.path quando executado como binário direto, ignorando os bootstraps do cli.py.",
    "fix": "Executar via 'python -m pytest' para garantir que o diretório atual seja tratado como parte do PYTHONPATH."
  },
  "css_parser_leniency_bug": {
    "title": "Falha na Detecção de CSS (Leniency do Parser)",
    "date": "2025-12-30",
    "severity": "LOW",
    "symptom": "O comando webcheck reportava [OK] mesmo para CSS com erros de sintaxe (;;;).",
    "root_cause": "A lib cssutils prioriza a recuperação de erros (error recovery) sobre a validação estrita, não lançando exceções para fragmentos 'feios' mas parseáveis.",
    "fix": "Implementada verificação de 'len(sheet.cssRules)' e validação de 'prop.value' para garantir que o estilo injetado seja funcional e não apenas ignorado pelo parser."
  },
  "style_complexity_irony": {
    "title": "A Ironia da Complexidade no Style",
    "date": "2025-12-30",
    "severity": "LOW",
    "symptom": "O comando 'doxoade check' acusou alta complexidade no próprio comando 'style'.",
    "root_cause": "O comando style acumulava responsabilidades de: descoberta de arquivos, orquestração de subprocesso e renderização de UI em uma única função.",
    "fix": "Refatoração para o padrão 'Expert-Split'. A função principal agora apenas coordena três funções especialistas, reduzindo o tamanho de 92 para 38 linhas, atingindo conformidade MPoT-4."
  },
  "intelligence_performance_spike": {
    "title": "Gargalo Crítico de CPU no Intelligence",
    "date": "2025-12-30",
    "severity": "HIGH",
    "symptom": "O comando intelligence levava mais de 1 minuto para processar 200 arquivos, drenando bateria no Termux.",
    "root_cause": "Uso da biblioteca 'chardet' para detecção de encoding em cada arquivo. O custo computacional de análise estatística de bytes era proibitivo.",
    "fix": "Implementação do Padrão 'Tiered Fallback Read'. O sistema agora tenta UTF-8 (nativo) e escala para Latin-1 apenas se necessário. Ganho de performance superior a 90%."
  },
  "pathlib_encoding_trap": {
    "title": "A Armadilha de Encoding do Pathlib",
    "date": "2025-12-30",
    "severity": "LOW",
    "symptom": "Testes de strings falhando no Windows (AssertionError) devido a caracteres como 'ç' e 'õ' corrompidos.",
    "root_cause": "O método 'Path.read_text()' usa o encoding do sistema por padrão (CP1252 no Windows). Se o comando escreve em UTF-8, o teste lê lixo binário.",
    "fix": "Obrigatoriedade de passar 'encoding=\"utf-8\"' em todos os métodos read_text e write_text dentro da suíte de testes do Doxoade."
  },
  "refactoring_unused_logger_trap": {
    "title": "A Armadilha do Logger Não Utilizado",
    "date": "2025-12-30",
    "severity": "LOW",
    "symptom": "Aviso de 'variable assigned but never used' no comando save.",
    "root_cause": "Após mover a lógica de aprendizado para funções puras que acessam o banco diretamente, o objeto 'logger' do context manager tornou-se desnecessário para o corpo da função, embora o context manager em si ainda fosse necessário para telemetria.",
    "fix": "Remoção do alias 'as logger'. O Doxoade agora mantém o monitoramento silencioso do comando sem poluir o escopo de variáveis."
  },
  "filter_root_path_bug": {
    "title": "Falha na Localização do Código Fonte para Filtros",
    "date": "2025-12-30",
    "severity": "HIGH",
    "symptom": "O comando 'check' ignorava a tag '# noqa', exibindo erros que deveriam estar silenciados.",
    "root_cause": "O orquestrador passava o 'project_root' para a função de filtragem, que tentava abrir a pasta raiz como se fosse um arquivo de texto, falhando na leitura das linhas e, consequentemente, ignorando os comentários de silenciamento.",
    "fix": "Refatoração do pipeline de relatório para agrupar achados por arquivo e invocar o filtro com caminhos absolutos validados, garantindo acesso ao conteúdo original da linha."
  },
  "interface_desynchronization": {
    "title": "Desincronização de Interface (Check vs Save)",
    "date": "2025-12-30",
    "severity": "CRITICAL",
    "symptom": "Crash fatal 'TypeError' durante a execução do comando save.",
    "root_cause": "A refatoração de limpeza do check.py removeu parâmetros legados (ignore, no_imports), mas as chamadas internas no save.py não foram atualizadas simultaneamente.",
    "fix": "Sincronização das assinaturas de função e restauração do parâmetro 'target_files' no orquestrador de lógica para permitir auditorias parciais rápidas."
  },
  "telemetry_memory_bloat": {
    "title": "Inchaço de Memória na Telemetria",
    "date": "2025-12-30",
    "severity": "MEDIUM",
    "symptom": "O comando 'telemetry --stats' consumia muita RAM ao calcular médias de longos históricos.",
    "root_cause": "A lógica anterior trazia todos os dados do banco para o Python e usava 'statistics.mean()'.",
    "fix": "Migração para 'Lean SQL Analytics'. O cálculo de médias agora ocorre dentro da engine do SQLite, transferindo apenas o resultado final para o Doxoade."
  },
  "winerror_5_rebuild_fix": {
    "title": "Superação do WinError 5 (Acesso Negado)",
    "date": "2026-01-01",
    "severity": "HIGH",
    "root_cause": "Locks do Windows em binários de venv ativos ou indexados por IDEs.",
    "fix": "Implementação do Padrão de Renomeação Transitória. O diretório bloqueado é movido para um nome temporário, permitindo a recriação imediata do ambiente no caminho original."
  },
  "cache_key_error_v69": {
    "title": "Crash por Inconsistência de Cache (KeyError)",
    "date": "2026-01-01",
    "severity": "HIGH",
    "root_cause": "O sistema assumia a existência de chaves 'mtime' em arquivos de cache gerados por versões legadas ou corrompidos.",
    "fix": "Implementação de verificações defensivas com '.get()' e 'all()'. O sistema agora descarta automaticamente entradas de cache mal-formadas, garantindo continuidade operacional (Fail-Soft)."
  },
  "autofix_partial_import_regression": {
    "title": "Regressão de Autofix em Imports Múltiplos",
    "date": "2026-01-01",
    "severity": "HIGH",
    "root_cause": "O motor de correção tratava 'from x import a, b' como uma linha atômica, comentando-a inteira quando apenas 'a' era inútil, quebrando o símbolo 'b'.",
    "fix": "Implementação do 'Neurocirurgião de Imports' no fixer.py, que decompõe a lista de símbolos e reconstrói a instrução preservando os elementos úteis."
  },
  "mtl_numerical_explosion": {
    "title": "Explosão de Incerteza e Saturação de LUT",
    "date": "2026-01-02",
    "severity": "CRITICAL",
    "symptom": "Loss disparando de 1.5 para 4.1 e Sigma (σ) explodindo em 3 épocas.",
    "root_cause": "Inicialização aleatória sem seed gerando ativações fora do range da MathLUT (-10, 10). O clipping da LUT gerou gradientes fantasmas que desorientaram o AdamW. O mecanismo de Smart Loss optou por aumentar a incerteza para mitigar o erro matemático.",
    "fix": "Implementação de Seed fixa (42), Fallback analítico na LUT para valores Extremos (Out-of-Range) e Gradient Clipping Global no orquestrador de treino."
  },
  "save_logic_crash_v71": {
    "title": "Crash de Escopo no Comando Save",
    "date": "2026-01-02",
    "severity": "HIGH",
    "root_cause": "Tentativa de acessar a variável 'fix_applied' sem inicialização prévia. O erro foi introduzido durante o planejamento da fase de auto-reversão do Protocolo Lázaro.",
    "fix": "Inicialização explícita de todas as flags de estado no topo do comando 'save', seguindo o padrão MPoT-6 (Escopo Limpo)."
  },
  "import_time_overhead_v71": {
    "title": "Sobrecarga de Importação (Efeito Colateral)",
    "date": "2026-01-02",
    "severity": "MEDIUM",
    "symptom": "Geração de tabelas MathLUT durante comandos administrativos (save/check).",
    "root_cause": "Instanciação de classes pesadas no escopo global de módulos importados pelo Core.",
    "fix": "Implementação de Lazy Initialization (Singleton Pattern). O custo computacional agora é postergado para o momento da primeira execução real da IA."
  },
  "persistence_interface_desync": {
    "title": "Desincronização da Interface de Persistência",
    "date": "2026-01-13",
    "severity": "CRITICAL",
    "symptom": "Crash imediato no comando 'check' após implementação do Async Worker.",
    "root_cause": "A refatoração do db_utils removeu acidentalmente a função '_update_open_incidents', quebrando o contrato com o orquestrador do Check.",
    "fix": "Restauração da função com blindagem MPoT-7 (isinstance check) para suportar resultados do linter em formato de string."
  }
}