{
  "lazarus": {
    "title": "Protocolo Lázaro (Anti-Crash & Forense)",
    "date": "2025-12-02",
    "content": "Sistema de recuperação de falhas catastróficas (Crash Recovery). Se o núcleo do Doxoade quebrar:\n1. O Wrapper de segurança captura o Traceback.\n2. O 'Smart Context' compara a linha quebrada com a última versão estável no Git.\n3. Uma análise forense sugere se foi um erro de lógica recente.\n4. O incidente é salvo para o motor Gênese aprender.\n\nComando associado: Automático (Rescue System)."
  },
  "phoenix": {
    "title": "Protocolo Fênix (Saúde de Ambiente)",
    "date": "2025-10-15",
    "content": "Conjunto de rotinas de auto-cura para o ambiente de desenvolvimento.\nObjetivo: Garantir que o código rode igual no Windows, Linux e Android (Termux).\n\nCapacidades:\n- Detecção e criação automática de venv.\n- Sincronização de requirements.txt.\n- Verificação de PATH e dependências globais.\n\nComandos: 'doctor', 'rebuild', 'global-health'."
  },
  "sapiens": {
    "title": "Arquitetura Sapiens (Memória Persistente)",
    "date": "2025-11-03",
    "content": "A camada de persistência que transforma o Doxoade de um Linter estático em um Engenheiro com memória.\nSubstituiu logs de texto por SQLite.\n\nTabelas:\n- Findings: Erros encontrados.\n- Incidents: Erros não resolvidos (Dívida Técnica).\n- Solutions: O que foi corrigido e como (Base para Gênese).\n\nComandos: 'history', 'log', 'dashboard'."
  },
  "mpot": {
    "title": "Padrão MPoT (Modern Power of Ten)",
    "date": "2025-12-01",
    "content": "Adaptação das regras de segurança de código da NASA (JPL) para Python moderno.\n\nRegras Aplicadas pelo comando 'style':\n1. Evitar fluxo de controle complexo (Recursão não limitada).\n2. Funções curtas (~60 linhas).\n3. Proibição de 'global'.\n4. Programação Defensiva (Asserts).\n5. Documentação obrigatória em interfaces públicas."
  },
  "genesis_v14": {
    "title": "Motor Gênese V14 (Estratégia & Abdução)",
    "date": "2025-12-05",
    "content": "A versão mais recente da IA Simbólica do Doxoade.\n\nEvolução:\n- Refatoração para 'Strategy Pattern' (Modularidade).\n- Capacidade de Abdução: Infere o que falta (ex: imports) sem precisar ver o erro antes.\n- Integração com Runtime: Aprende com falhas de execução capturadas pelo 'flow'."
  },
  "aegis": {
    "title": "Protocolo Aegis (Blindagem & Hardening)",
    "date": "2025-12-15",
    "content": "Política de Segurança de Tolerância Zero.\n\nDiretrizes:\n1. 'Ground Zero': Nenhuma vulnerabilidade HIGH ou MEDIUM é permitida no master.\n2. Proibição de 'shell=True' e 'os.system' em comandos de produção.\n3. Dados sobre Código: Preferência estrita por JSON em vez de Pickle para persistência.\n4. Filtragem Dupla: O sistema de segurança filtra falsos positivos antes de alertar o usuário.\n\nComando associado: 'security --level HIGH'"
  },
  "canon_v2": {
    "title": "Protocolo Cânone V2 (Regressão Relativa)",
    "date": "2025-12-20",
    "content": "Evolução do sistema de QA. O 'Cânone' agora grava não apenas a análise estática, mas o estado de execução dos testes (Exit Code).\n\nPrincípio da Relatividade:\nSe o projeto estava falhando no momento do Snapshot (Canonize) e continua falhando da mesma maneira, o sistema considera 'APROVADO'. Regressão é apenas a introdução de *novas* falhas.\n\nComandos: 'canonize --all', 'regression-test'."
  },
  "ouroboros_git": {
    "title": "Protocolo Ouroboros (Auto-Reconciliação Git)",
    "date": "2025-12-20",
    "content": "Capacidade dos comandos de infraestrutura de se curarem ao encontrar estados inesperados.\n\nExemplo Prático:\nAo rodar 'git-new' em um repositório remoto não-vazio, o Doxoade detecta a rejeição, executa um 'pull --rebase --allow-unrelated-histories' automaticamente e tenta o push novamente, fundindo os históricos sem intervenção humana."
  },
  "phoenix_v2": {
    "title": "Protocolo Fênix (v2 Gold)",
    "date": "2025-12-30",
    "content": "A auto-cura do ambiente agora é baseada em 'Isolamento de Sonda'. O Doctor injeta scripts efêmeros nos venvs dos projetos para verificar integridade sem contaminar o processo principal do Doxoade. Inclui auditoria de PATH e reorganização semântica de arquivos de configuração (.gitignore)."
  },
  "test_mirror_policy": {
    "title": "Política de Espelhamento de Testes",
    "type": "Mandatory",
    "description": "A estrutura do diretório 'tests/' deve espelhar exatamente a estrutura do pacote 'doxoade/'. Exemplo: O código em 'doxoade/commands/check.py' deve ser testado em 'tests/doxoade/commands/test_check.py'. Arquivos fora dessa estrutura são considerados 'Legacy' ou 'Sandbox' e devem residir em 'tests/old/'."
  },
  "pasc": {
    "title": "PASC (Atualização Segura de Códigos)",
    "date": "2026-01-09",
    "content": "Conjunto de 10 leis para integridade de software. Foco em Anti-Regressividade (Regra 2) e Verbosidade Seletiva (Regra 6) para controle de recursos."
  },
  "chief_gold_ui": {
    "title": "Padrão Visual Chief-Gold",
    "date": "2026-01-13",
    "content": "Protocolo de simetria industrial para CLIs. Exige alinhamento de colchetes de linha [ 000 ] e padding dinâmico de pontos para caminhos em Azul-Brilhante."
  },
  "lazy_dispatch": {
    "title": "Protocolo de Despacho Lazy",
    "date": "2026-01-13",
    "content": "Proíbe a importação de dependências pesadas no escopo global do Core. Garante que o custo de processamento seja proporcional à tarefa executada."
  },
  "pasc_1_1": {
    "title": "PASC-1.1 (Resgate Temporal)",
    "date": "2026-01-16",
    "content": "Protocolo de proteção contra erosão funcional. Exige o uso do 'diff -l' para validar que a reformulação do código não resultou em perda de argumentos ou utilitários essenciais."
  },
  "semantic_contract_integrity": {
    "title": "Integridade de Contrato Semântico",
    "date": "2026-01-14",
    "content": "Diretriz que prioriza a manutenção da assinatura das funções (API interna). Se um argumento for removido, ele deve ser reciclado ou documentado conforme PASC-9."
  },
  "pasc": {
    "title": "PASC (Políticas de Atualização Segura de Códigos)",
    "date": "2026-01-14",
    "content": "Conjunto de 10 leis para evolução de software. Destaque para a Lei 1.1 (Resgate Temporal), que exige auditoria de assinaturas históricas para evitar a poda acidental de funcionalidades durante refatorações."
  },
  "pasc_6": {
    "title": "PASC-6 (Verbosidade Seletiva)",
    "date": "2026-01-14",
    "content": "6.1: Importações explícitas para controle de RAM. 6.2: Funcionalidades externas verbosas para auditoria de fluxo. 6.3: Obrigatoriedade de UTF-8 nativo."
  },
  "semantic_archival": {
    "title": "Arquivologia Semântica (Legacy Audit)",
    "date": "2026-01-14",
    "content": "Uso de AST sobre o histórico do Git para validar a evolução de contratos (assinaturas de funções) em vez de apenas texto bruto."
  },
  "aegis_v2": {
    "title": "Aegis Protocol (Hardening)",
    "date": "2026-01-15",
    "content": "Proíbe estritamente shell=True e exige silenciamento deliberado (# nosec) apenas após revisão humana. Zera falsos positivos de segurança em profilers (exec/eval)."
  },
  "chief_gold_ui": {
    "title": "Chief-Gold Visual Standard",
    "date": "2026-01-15",
    "content": "Padrão de simetria industrial: Alinhamento de colchetes fixos [ 000 ] e padding dinâmico de pontos para caminhos Azul-Cobalto."
  },
  "aegis_sandbox": {
    "title": "Protocolo Aegis (Sandbox)",
    "date": "2026-01-16",
    "content": "Garantia de que qualquer execução dinâmica (exec/eval) seja precedida por análise AST e restrição total de builtins, eliminando riscos de RCE e Injeção."
  },
  "alb_v19": {
    "title": "Protocolo ALB v1.9 (Simbiose Digital)",
    "date": "2026-01-24",
    "content": "Sistema de balanceamento adaptativo que modula a carga do Doxoade baseado no estresse do processador e memória do hospedeiro.\nInclui o 'Targeted Bypass' para garantir performance instantânea em scans de arquivo único."
  },
  "ufs_v10": {
    "title": "Unified File Streamer (UFS)",
    "date": "2026-01-24",
    "content": "Camada de abstração de I/O que garante que cada arquivo de código seja lido apenas uma vez do disco por ciclo. Compartilha buffers em RAM entre check, analysis e filters."
  },
  "memory_arena_gold": {
    "title": "Arena de Memória Chief-Gold",
    "date": "2026-01-24",
    "content": "Implementação estrita de MPoT-3. Pré-alocação de objetos para evitar o overhead do Garbage Collector do Python durante scans massivos."
  },
  "nexus_flow_v33": {
    "title": "Protocolo Nexus Flow v3.3 (Lentes Seletivas)",
    "date": "2026-01-29",
    "content": "Sistema de observabilidade avançada com filtragem de ruído. Permite alternar entre rastro de valores (--flow-val), auditoria de I/O de módulos (--flow-import) e visualização de Call Stack hierárquica (--flow-func)."
  },
  "process_reaper": {
    "title": "Protocolo Ceifador (Reaper Protocol)",
    "date": "2026-01-28",
    "content": "Mecanismo de segurança Aegis que garante a integridade do sistema operacional do usuário, impedindo que subprocessos (servidores/crawlers) sobrevivam à finalização do comando pai."
  },
  "nexus_silence_gold": {
    "title": "Protocolo Nexus Silence (v42.7)",
    "date": "2026-01-30",
    "content": "Diretriz de UX industrial que proíbe o spam de mensagens de sistema no terminal. Consolida intervenções do ALB em um único relatório de eficiência no rodapé do comando."
  },
  "iron_gate_compression": {
    "title": "Iron Gate (Compressão de Fluxo)",
    "date": "2026-01-29",
    "content": "Algoritmo de monitoramento que detecta padrões cíclicos de execução (A-B-A-B) e os colapsa em uma única linha informativa para preservar a clareza do diagnóstico."
  }
}